package db;

import dto.ItemDto;

import java.util.ArrayList;
import java.util.List;

import static db.DbHelper.addToDb;

//emulateDb
public class Db {

    public static List<ItemDto> list = new ArrayList<>();

    static {
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");
        addToDb("1", "Бутылка", "70 руб.");
        addToDb("2", "Банка", "41 руб.");
        addToDb("3", "Реклама", "700 руб.");

    }
}
