package db;

import dto.ItemDto;

import java.util.ArrayList;
import java.util.List;

import static db.DbHelper.addToDb;

//emulateDb
public class Db {

    public static List<ItemDto> list = new ArrayList<>();

    static {
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
        addToDb("1", "Кольцо лисичка", "700 руб.");
    }
}
